Tekla.Structures.Drawing.RadiusDimensionAttributes
The RadiusDimensionAttributes class contains attributes to manage all the attributes of a straight dimension.
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
RadiusDimensionAttributes attributes = new RadiusDimensionAttributes("MyAttributes");
}
}

Tekla.Structures.Drawing.RadiusDimensionAttributes.#ctor
Creates a new radius dimension attributes instance which loads standard attributes.

Tekla.Structures.Drawing.RadiusDimensionAttributes.#ctor(System.Boolean)
Creates a new radius dimension attributes instance which loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.RadiusDimensionAttributes.#ctor(System.String)
Creates a new radius dimension attributes instance that loads the specified attributes.
AttributesFile: The attributes file's filename.

Tekla.Structures.Drawing.RadiusDimensionAttributes.LoadAttributes(System.String)
Loads attributes from the specified attribute file.
AttributeFile: The attribute file's filename.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.RadiusDimensionAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.